{"keras_version": "2.0.4", "backend": "tensorflow", "class_name": "Model", "config": {"output_layers": [["loss", 0, 0]], "name": "squeezenet", "input_layers": [["input_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 227, 227, 3], "dtype": "float32"}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "conv1", "config": {"padding": "valid", "kernel_size": [3, 3], "name": "conv1", "activity_regularizer": null, "kernel_constraint": null, "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [2, 2], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv1", 0, 0, {}]]], "name": "relu_conv1", "config": {"trainable": true, "activation": "relu", "name": "relu_conv1"}, "class_name": "Activation"}, {"inbound_nodes": [[["relu_conv1", 0, 0, {}]]], "name": "pool1", "config": {"pool_size": [3, 3], "padding": "valid", "trainable": true, "name": "pool1", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["pool1", 0, 0, {}]]], "name": "fire2/squeeze1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire2/squeeze1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 16, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire2/squeeze1x1", 0, 0, {}]]], "name": "fire2/relu_squeeze1x1", "config": {"trainable": true, "activation": "relu", "name": "fire2/relu_squeeze1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "name": "fire2/expand1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire2/expand1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire2/relu_squeeze1x1", 0, 0, {}]]], "name": "fire2/expand3x3", "config": {"padding": "same", "kernel_size": [3, 3], "name": "fire2/expand3x3", "activity_regularizer": null, "kernel_constraint": null, "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire2/expand1x1", 0, 0, {}]]], "name": "fire2/relu_expand1x1", "config": {"trainable": true, "activation": "relu", "name": "fire2/relu_expand1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire2/expand3x3", 0, 0, {}]]], "name": "fire2/relu_expand3x3", "config": {"trainable": true, "activation": "relu", "name": "fire2/relu_expand3x3"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire2/relu_expand1x1", 0, 0, {}], ["fire2/relu_expand3x3", 0, 0, {}]]], "name": "fire2/concat", "config": {"trainable": true, "axis": 3, "name": "fire2/concat"}, "class_name": "Concatenate"}, {"inbound_nodes": [[["fire2/concat", 0, 0, {}]]], "name": "fire3/squeeze1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire3/squeeze1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 16, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire3/squeeze1x1", 0, 0, {}]]], "name": "fire3/relu_squeeze1x1", "config": {"trainable": true, "activation": "relu", "name": "fire3/relu_squeeze1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "name": "fire3/expand1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire3/expand1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire3/relu_squeeze1x1", 0, 0, {}]]], "name": "fire3/expand3x3", "config": {"padding": "same", "kernel_size": [3, 3], "name": "fire3/expand3x3", "activity_regularizer": null, "kernel_constraint": null, "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire3/expand1x1", 0, 0, {}]]], "name": "fire3/relu_expand1x1", "config": {"trainable": true, "activation": "relu", "name": "fire3/relu_expand1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire3/expand3x3", 0, 0, {}]]], "name": "fire3/relu_expand3x3", "config": {"trainable": true, "activation": "relu", "name": "fire3/relu_expand3x3"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire3/relu_expand1x1", 0, 0, {}], ["fire3/relu_expand3x3", 0, 0, {}]]], "name": "fire3/concat", "config": {"trainable": true, "axis": 3, "name": "fire3/concat"}, "class_name": "Concatenate"}, {"inbound_nodes": [[["fire3/concat", 0, 0, {}]]], "name": "pool3", "config": {"pool_size": [3, 3], "padding": "valid", "trainable": true, "name": "pool3", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["pool3", 0, 0, {}]]], "name": "fire4/squeeze1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire4/squeeze1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 32, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire4/squeeze1x1", 0, 0, {}]]], "name": "fire4/relu_squeeze1x1", "config": {"trainable": true, "activation": "relu", "name": "fire4/relu_squeeze1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "name": "fire4/expand1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire4/expand1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 128, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire4/relu_squeeze1x1", 0, 0, {}]]], "name": "fire4/expand3x3", "config": {"padding": "same", "kernel_size": [3, 3], "name": "fire4/expand3x3", "activity_regularizer": null, "kernel_constraint": null, "filters": 128, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire4/expand1x1", 0, 0, {}]]], "name": "fire4/relu_expand1x1", "config": {"trainable": true, "activation": "relu", "name": "fire4/relu_expand1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire4/expand3x3", 0, 0, {}]]], "name": "fire4/relu_expand3x3", "config": {"trainable": true, "activation": "relu", "name": "fire4/relu_expand3x3"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire4/relu_expand1x1", 0, 0, {}], ["fire4/relu_expand3x3", 0, 0, {}]]], "name": "fire4/concat", "config": {"trainable": true, "axis": 3, "name": "fire4/concat"}, "class_name": "Concatenate"}, {"inbound_nodes": [[["fire4/concat", 0, 0, {}]]], "name": "fire5/squeeze1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire5/squeeze1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 32, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire5/squeeze1x1", 0, 0, {}]]], "name": "fire5/relu_squeeze1x1", "config": {"trainable": true, "activation": "relu", "name": "fire5/relu_squeeze1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "name": "fire5/expand1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire5/expand1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 128, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire5/relu_squeeze1x1", 0, 0, {}]]], "name": "fire5/expand3x3", "config": {"padding": "same", "kernel_size": [3, 3], "name": "fire5/expand3x3", "activity_regularizer": null, "kernel_constraint": null, "filters": 128, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire5/expand1x1", 0, 0, {}]]], "name": "fire5/relu_expand1x1", "config": {"trainable": true, "activation": "relu", "name": "fire5/relu_expand1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire5/expand3x3", 0, 0, {}]]], "name": "fire5/relu_expand3x3", "config": {"trainable": true, "activation": "relu", "name": "fire5/relu_expand3x3"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire5/relu_expand1x1", 0, 0, {}], ["fire5/relu_expand3x3", 0, 0, {}]]], "name": "fire5/concat", "config": {"trainable": true, "axis": 3, "name": "fire5/concat"}, "class_name": "Concatenate"}, {"inbound_nodes": [[["fire5/concat", 0, 0, {}]]], "name": "pool5", "config": {"pool_size": [3, 3], "padding": "valid", "trainable": true, "name": "pool5", "data_format": "channels_last", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["pool5", 0, 0, {}]]], "name": "fire6/squeeze1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire6/squeeze1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 48, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire6/squeeze1x1", 0, 0, {}]]], "name": "fire6/relu_squeeze1x1", "config": {"trainable": true, "activation": "relu", "name": "fire6/relu_squeeze1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "name": "fire6/expand1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire6/expand1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 192, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire6/relu_squeeze1x1", 0, 0, {}]]], "name": "fire6/expand3x3", "config": {"padding": "same", "kernel_size": [3, 3], "name": "fire6/expand3x3", "activity_regularizer": null, "kernel_constraint": null, "filters": 192, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire6/expand1x1", 0, 0, {}]]], "name": "fire6/relu_expand1x1", "config": {"trainable": true, "activation": "relu", "name": "fire6/relu_expand1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire6/expand3x3", 0, 0, {}]]], "name": "fire6/relu_expand3x3", "config": {"trainable": true, "activation": "relu", "name": "fire6/relu_expand3x3"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire6/relu_expand1x1", 0, 0, {}], ["fire6/relu_expand3x3", 0, 0, {}]]], "name": "fire6/concat", "config": {"trainable": true, "axis": 3, "name": "fire6/concat"}, "class_name": "Concatenate"}, {"inbound_nodes": [[["fire6/concat", 0, 0, {}]]], "name": "fire7/squeeze1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire7/squeeze1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 48, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire7/squeeze1x1", 0, 0, {}]]], "name": "fire7/relu_squeeze1x1", "config": {"trainable": true, "activation": "relu", "name": "fire7/relu_squeeze1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "name": "fire7/expand1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire7/expand1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 192, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire7/relu_squeeze1x1", 0, 0, {}]]], "name": "fire7/expand3x3", "config": {"padding": "same", "kernel_size": [3, 3], "name": "fire7/expand3x3", "activity_regularizer": null, "kernel_constraint": null, "filters": 192, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire7/expand1x1", 0, 0, {}]]], "name": "fire7/relu_expand1x1", "config": {"trainable": true, "activation": "relu", "name": "fire7/relu_expand1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire7/expand3x3", 0, 0, {}]]], "name": "fire7/relu_expand3x3", "config": {"trainable": true, "activation": "relu", "name": "fire7/relu_expand3x3"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire7/relu_expand1x1", 0, 0, {}], ["fire7/relu_expand3x3", 0, 0, {}]]], "name": "fire7/concat", "config": {"trainable": true, "axis": 3, "name": "fire7/concat"}, "class_name": "Concatenate"}, {"inbound_nodes": [[["fire7/concat", 0, 0, {}]]], "name": "fire8/squeeze1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire8/squeeze1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire8/squeeze1x1", 0, 0, {}]]], "name": "fire8/relu_squeeze1x1", "config": {"trainable": true, "activation": "relu", "name": "fire8/relu_squeeze1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "name": "fire8/expand1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire8/expand1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 256, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire8/relu_squeeze1x1", 0, 0, {}]]], "name": "fire8/expand3x3", "config": {"padding": "same", "kernel_size": [3, 3], "name": "fire8/expand3x3", "activity_regularizer": null, "kernel_constraint": null, "filters": 256, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire8/expand1x1", 0, 0, {}]]], "name": "fire8/relu_expand1x1", "config": {"trainable": true, "activation": "relu", "name": "fire8/relu_expand1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire8/expand3x3", 0, 0, {}]]], "name": "fire8/relu_expand3x3", "config": {"trainable": true, "activation": "relu", "name": "fire8/relu_expand3x3"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire8/relu_expand1x1", 0, 0, {}], ["fire8/relu_expand3x3", 0, 0, {}]]], "name": "fire8/concat", "config": {"trainable": true, "axis": 3, "name": "fire8/concat"}, "class_name": "Concatenate"}, {"inbound_nodes": [[["fire8/concat", 0, 0, {}]]], "name": "fire9/squeeze1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire9/squeeze1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 64, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire9/squeeze1x1", 0, 0, {}]]], "name": "fire9/relu_squeeze1x1", "config": {"trainable": true, "activation": "relu", "name": "fire9/relu_squeeze1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "name": "fire9/expand1x1", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "fire9/expand1x1", "activity_regularizer": null, "kernel_constraint": null, "filters": 256, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire9/relu_squeeze1x1", 0, 0, {}]]], "name": "fire9/expand3x3", "config": {"padding": "same", "kernel_size": [3, 3], "name": "fire9/expand3x3", "activity_regularizer": null, "kernel_constraint": null, "filters": 256, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["fire9/expand1x1", 0, 0, {}]]], "name": "fire9/relu_expand1x1", "config": {"trainable": true, "activation": "relu", "name": "fire9/relu_expand1x1"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire9/expand3x3", 0, 0, {}]]], "name": "fire9/relu_expand3x3", "config": {"trainable": true, "activation": "relu", "name": "fire9/relu_expand3x3"}, "class_name": "Activation"}, {"inbound_nodes": [[["fire9/relu_expand1x1", 0, 0, {}], ["fire9/relu_expand3x3", 0, 0, {}]]], "name": "fire9/concat", "config": {"trainable": true, "axis": 3, "name": "fire9/concat"}, "class_name": "Concatenate"}, {"inbound_nodes": [[["fire9/concat", 0, 0, {}]]], "name": "drop9", "config": {"trainable": true, "name": "drop9", "rate": 0.5}, "class_name": "Dropout"}, {"inbound_nodes": [[["drop9", 0, 0, {}]]], "name": "conv10", "config": {"padding": "valid", "kernel_size": [1, 1], "name": "conv10", "activity_regularizer": null, "kernel_constraint": null, "filters": 1000, "dilation_rate": [1, 1], "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "strides": [1, 1], "trainable": true, "kernel_regularizer": null, "activation": "linear", "data_format": "channels_last"}, "class_name": "Conv2D"}, {"inbound_nodes": [[["conv10", 0, 0, {}]]], "name": "relu_conv10", "config": {"trainable": true, "activation": "relu", "name": "relu_conv10"}, "class_name": "Activation"}, {"inbound_nodes": [[["relu_conv10", 0, 0, {}]]], "name": "global_average_pooling2d_1", "config": {"trainable": true, "data_format": "channels_last", "name": "global_average_pooling2d_1"}, "class_name": "GlobalAveragePooling2D"}, {"inbound_nodes": [[["global_average_pooling2d_1", 0, 0, {}]]], "name": "loss", "config": {"trainable": true, "activation": "softmax", "name": "loss"}, "class_name": "Activation"}]}}